-- 임찬규 선수 시즌별 기록
INSERT INTO player_record (year, game_count, innings, era, wins, losses, save, strikeouts) VALUES
                                                                                               (2011, 65, 82.666, 4.46, 9, 6, 7, 62),
                                                                                               (2012, 18, 55.666, 4.53, 1, 5, 0, 31),
                                                                                               (2013, 17, 44.0,   4.70, 1, 1, 0, 45),
                                                                                               (2016, 15, 47.0,   6.51, 3, 3, 0, 38),
                                                                                               (2017, 27, 124.333,4.63, 6, 10, 0, 113),
                                                                                               (2018, 29, 146.666,5.77,11, 11, 1, 125),
                                                                                               (2019, 30, 88.666, 4.97, 3, 5, 0, 72),
                                                                                               (2020, 27, 147.666,4.08,10, 9, 0, 138),
                                                                                               (2021, 17, 90.666, 3.87, 1, 8, 0, 67),
                                                                                               (2022, 23, 103.666,5.04, 6,11, 0, 75),
                                                                                               (2023, 30, 144.666,3.42,14, 3, 0, 103),
                                                                                               (2024, 25, 134.0,  3.83,10, 6, 0, 136),
                                                                                               (2025, 2,  14.666, 0.61, 2, 0, 0, 10);

-- 임찬규 명장면 하이라이트
INSERT INTO highlights (title, description, media_url, created_at) VALUES
                                                                       ('생애 첫 완봉승 인터뷰', '“생애 첫 완봉승은 돌아가신 아버지께 꼭 전해드리고 싶습니다” 임찬규, 딱 100구로 9이닝 끝냈다 (25.03.26)', 'https://www.youtube.com/watch?v=NrI9ZaTqECY', NOW()),
                                                                       ('[3.26 vs 한화] 데뷔 첫 완투·완봉승', '[3.26 vs 한화] \'9이닝 무실점\' 임찬규의 데뷔 첫 완투·완봉승', 'https://youtube.com/shorts/UgZo5Tc62ic?si=AUL9fIOAqCF6cl6m', NOW()),
                                                                       ('9회 투구 감상 | 크보모먼트', '[한화 vs LG](노컷) LG 임찬규의 9회 투구를 감상하시기 바랍니다. | 3.26 | 크보모먼트 BY 삼진제약', 'https://youtu.be/Vmh88zU5Oxs?si=sUxuR1ZqX26ozMFZ&t=6', NOW()),
                                                                       ('준플레이오프 5차전 호투 모음', '준플레이오프를 승리로 이끈 MVP 임찬규의 준PO 5차전 호투 모음.zip [10월 11일 임찬규 하이라이트]', 'https://youtu.be/ToMc2qq8MIY?si=k8cdYir5DXw_6Q30', NOW()),
                                                                       ('외야수 임찬규 드립', '경기장에 냅다 누워버리는 외야수 임찬규, ㅋㅋㅋ 진짜 개열받음', 'https://youtube.com/shorts/MENPsS-treY?si=aRoi5TV0ZjA2S0Zx', NOW());
